Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: We can register `Legume` for reflection manually by adding the `@RegisterForReflection` annotation on our `Legume` class:
ja_jp: `Legume` クラスに `@RegisterForReflection` アノテーションを追加することで、手動で `Legume` を リフレクション用に登録することができます。

source: We can say a log line is a type of event that includes a severity classification. The OpenTelemetry project recognizes this approach, resulting in an OpenTelemetry API for logs and events that is pretty much the same.
ja_jp: ログラインは、重大度分類を含むイベントの種類であると言えます。OpenTelemetry プロジェクトはこのアプローチを認識しており、ログとイベント用の OpenTelemetry API はほぼ同じになっています。

source: We can see above that one of the `persist` is to `javax.persistence.EntityManager`. This is the JPA method for persisting entities and the one we'll be exploring further. Let's narrow the query down to that one to have a clearer view:
ja_jp: 上では、 `persist` の一つが `javax.persistence.EntityManager` になっているのがわかります。これはエンティティを永続化するためのJPAのメソッドであり、これからさらに探索していくものです。より明確な情報を得るために、クエリをその1つに絞ってみましょう。

source: We can then extend this with an integration test that can be used to test the native executable or runnable jar:
ja_jp: これを統合テストで拡張し、ネイティブ実行可能ファイルや実行可能jarをテストするために使用することができます:

source: We can use the JFR CLI to configure the events that JFR will record. The configuration file, JFC file, is in XML format, so we can modify it with a text editor. However, it is recommended to use `jfr configure`, which is included in OpenJDK by default.
ja_jp: JFR CLI を使用して、JFR が記録するイベントを設定できます。 設定ファイルである JFC ファイルは XML 形式なので、テキストエディターで変更できます。 ただし、OpenJDK にデフォルトで含まれている `jfr configure` を使用することを推奨します。

source: We can write a simple test for our CLI application above as follows:
ja_jp: 上記のCLIアプリケーションの簡単なテストを以下のように書くことができます:

source: We chose to align Quarkus docs with the Diátaxis documentation framework{fn-diataxis}, which defines a core content structure that addresses the different needs users have when consulting docs.
ja_jp: QuarkusのドキュメントをDiátaxisドキュメンテーションフレームワーク{fn-diataxis}に合わせることにしました。これは、ドキュメントを参照するときにユーザーが持つさまざまなニーズに対応するコア コンテンツ構造を定義します。

source: We configure the password mapper with the position of the password field in the `SELECT` fields and other information like salt, hash encoding, etc. Setting the salt and iteration count indexes to `-1` is required for MCF.
ja_jp: `SELECT` 、パスワード・フィールドの位置や、ソルト、ハッシュ・エンコーディングなどの情報をパスワード・マッパーに設定します。 MCFに必要なため、ソルトと反復回数のインデックスを `-1` に設定します。

source: We consume a ShutdownContextBuildItem to register the service shutdown.
ja_jp: ShutdownContextBuildItemを消費してサービスのシャットダウンを登録します。

source: We consume the previously initialized service captured in `RuntimeServiceBuildItem`.
ja_jp: `RuntimeServiceBuildItem` で取得した、以前に初期化したサービスを消費します。

source: We consume the previously produced ``GitHubApiClassWithBridgeMethodsBuildItem``s.
ja_jp: 先に生産された `GitHubApiClassWithBridgeMethodsBuildItem`s を消費します。

source: We continue improving RESTEasy Reactive at a steady pace, and this time, we introduced Multipart support.
ja_jp: RESTEasy Reactiveの改善を着実に続けており、今回はMultipart対応を導入しました。

source: We continue to make progress on the road to Quarkus 2.0.
ja_jp: Quarkus 2.0への道筋は、引き続き進展しています。

source: We could write a test for this endpoint very easily like so:
ja_jp: このエンドポイントのテストは次のように簡単に書けます。

source: We create a predicate: if the pattern is empty, we use a `matchAll()` predicate.
ja_jp: 述語を作成します。パターンが空の場合は `matchAll()` 述語を使用します。

source: We create a sample application that logs timestamps for certain points in the application lifecycle.
ja_jp: アプリケーションのライフサイクルのある時点のタイムスタンプを記録するサンプルアプリケーションを作成します。

source: We create a sample, which records the start of the timer.
ja_jp: タイマーの開始を記録するサンプルを作成します。

source: We create a simple CDI bean to abstract away the Rule Unit API usage with:
ja_jp: 次のようにして、ルールユニット API の使用を抽象化するためのシンプルな CDI Bean を作成します。

source: We create an Elasticsearch index request using a builder.
ja_jp: ビルダーを使って、Elasticsearchのインデックスリクエストを作成します。

source: We create an Elasticsearch index request.
ja_jp: Elasticsearchのインデックスリクエストを作成します。

source: We create an Elasticsearch request.
ja_jp: Elasticsearchリクエストを作成します。

source: We create the first increment, with the key `first` and an initial value of `10`.
ja_jp: 最初のインクリメントを作成し、キーは `first` 、初期値は `10` とします

source: We currently include these built-in database kinds:
ja_jp: 現在のところ、これらの組み込みデータベースの種類が含まれています。

source: We decided to focus on what most users need from a modern REST layer instead of implementing every single feature required by the JAX-RS TCK. So in that vein, there is no XML support in RESTEasy Reactive, while various arcane features of the spec are also not supported (like _javax.activation.DataSource_, _javax.annotation.ManagedBean_, _javax.ws.rs.core.StreamingOutput_).
ja_jp: 私たちは、JAX-RS TCK が必要とする機能をすべて実装するのではなく、ほとんどのユーザーが最新の REST レイヤから必要とするものに焦点を当てることにしました。 そのため、RESTEasy Reactive には XML サポートがなく、仕様の様々な難解な機能もサポートされていません(_javax.activation.DataSource_, _javax.annotation.ManagedBean_, _javax.ws.rs.core.StreamingOutput_ のようなもの)。

source: We decided to move some of the extensions to the Quarkiverse Hub so that they are easier to contribute to and to allow us to reduce the size of the Core repository.
ja_jp: エクステンションの一部をQuarkiverse Hubに移行することで、より貢献しやすくなり、Coreリポジトリのサイズを小さくすることができました。

source: We decided to name the client `star-wars-dynamic`. We will use this name when injecting a dynamic client to properly qualify the injection point.
ja_jp: このクライアントの名前を `star-wars-dynamic` としました。動的なクライアントを注入する際には、注入ポイントを適切に特定するためにこの名前を使用します。

source: We define a parameterized SQL statement (with exactly 1 parameter) which should return the user's password plus any additional information you want to load.
ja_jp: ユーザーのパスワードと、ロードしたい追加情報を返却するパラメーター化されたSQL文(単一のパラメーター付)を定義しています。

source: We define the sort order of our results. Here we sort by last name, then by first name. Note that we use the specific fields we created for sorting.
ja_jp: 結果のソート順を定義します。ここでは、姓でソートし、次に名でソートしています。ソートには作成した特定のフィールドを使用していることに注意してください。

source: We define the term `Multi` in a way that helps a user find their way to other related materials (How to, Concept, or Reference).
ja_jp: `Multi` という用語は、ユーザーが他の関連資料 (ハウツー、コンセプト、またはリファレンス) にたどりつけるような形で定義しています。

source: We describe how to use `curl` to test the output of our defined endpoint.
ja_jp: 定義したエンドポイントの出力をテストするために `curl` を使用する方法を説明しています。

source: We describe what `@Anvil` is providing in the specific case covered by this tutorial.
ja_jp: このチュートリアルで取り上げる特定のケースで `@Anvil` が提供するものについて説明します。

source: We described Quarkus most common ways to create web applications but there are other options:
ja_jp: Quarkus で Web アプリケーションを作成する最も一般的な方法について説明しましたが、他にもオプションがあります。

source: We developed a simple application, receives HTTP requests, writes Kafka records, and reads them from Kafka. It uses Avro to serialize and deserialize the records.
ja_jp: HTTPリクエストを受信し、Kafkaのレコードを書き込み、Kafkaからレコードを読み出すというシンプルなアプリケーションを開発しました。 Avroを使ってレコードのシリアライズとデシリアライズを行っています。

source: We directly pass the object to the request as the Java API client has a serialization layer.
ja_jp: Java APIクライアントにはシリアライズ層があるため、オブジェクトを直接リクエストに渡します。

source: We do know some of you are looking for a more stable release cadence, and we are working on a new long-term support (LTS) policy starting from Quarkus 3.2. We will provide details on this as we get closer to the 3.2 release. Java 11 will still be supported there for the core part of Quarkus.
ja_jp: より安定したリリースサイクルを求めている方もいらっしゃると思いますので、Quarkus 3.2からの新しい長期サポート（LTS）ポリシーに取り組んでいます。これについては、3.2のリリースが近づいたら詳細をお知らせします。Java 11は、Quarkusのコア部分については、引き続きサポートされる予定です。

source: We do not go into detail explaining concepts:
ja_jp: 概念の詳細については説明しません。

source: We do not recommend injecting contextual information specific to a runtime. Keep your functions portable.
ja_jp: ランタイムに固有のコンテキスト情報を注入することは推奨されません。 ファンクションを移植性の高いものにしてください。

source: We do not recommend using this configuration property and plan to remove it in the future. You should update your application accordingly. If you believe your use case justifies keeping this option, open an issue in the link:https://github.com/quarkusio/quarkus/issues/new?assignees=&labels=kind%2Fenhancement&projects=&template=feature_request.yml[Quarkus tracker] explaining why.
ja_jp: この設定プロパティの使用は推奨しておらず、将来的に削除する予定です。アプリケーションを適宜更新してください。このオプションを維持することが正当な使用例であると考えられる場合は、 link:https://github.com/quarkusio/quarkus/issues/new?assignees=&labels=kind%2Fenhancement&projects=&template=feature_request.yml[Quarkusのトラッカー] にその理由を説明するissueを作成してください。

source: We do not recommend using this configuration property, and we plan to remove it in the future, so you should fix your application accordingly. If you think your use case of this feature is valid and this option should be kept around, open an issue in the link:https://github.com/quarkusio/quarkus/issues/new?assignees=&labels=kind%2Fenhancement&projects=&template=feature_request.yml[Quarkus tracker] explaining why.
ja_jp: この設定プロパティーの使用は推奨されません。将来的には削除される予定なので、それに応じてアプリケーションを修正する必要があります。 この機能のユースケースが有効であり、このオプションを維持すべきだと思われる場合は、link:https://github.com/quarkusio/quarkus/issues/new?assignees=&labels=kind%2Fenhancement&projects=&template=feature_request.yml[Quarkus トラッカー] で issue を作成し、 理由を説明してください。

source: We don't generally add a release note entry for new guides but this one is well worth it. If you want to understand better how native executables are built and how you can work with them, read link:/guides/native-reference[our new Native Reference Guide].
ja_jp: 通常、新しいガイドにはリリースノートのエントリを追加しませんが、今回のガイドはその価値があります。ネイティブ実行可能ファイルがどのように作られているのか、どのように扱えばいいのかをもっと理解したい方は、 link:/guides/native-reference[新しいネイティブリファレンスガイド]をお読みください。

source: We don't generate a no-args constructor automatically if a bean class extends a class that does not declare a no-args constructor.
ja_jp: 変数無しコンストラクターを宣言していないクラスを Bean クラスが継承している場合は、変数無しコンストラクターは自動的に生成されません。

source: We don't have a ton of big new features in Quarkus 2.13.0.Final but it comes with a ton of small enhancements that should improve your overall experience with Quarkus.
ja_jp: Quarkus 2.13.0.Finalには、大きな新機能はありませんが、Quarkusの全体的な使用感を向上させる小さな機能改善が多数含まれています。

source: We don't have plans to support the Lucene backend in Quarkus for now, though there is an issue tracking progress on such an implementation in the Quarkiverse: https://github.com/quarkiverse/quarkus-hibernate-search-extras/issues/179[quarkiverse/quarkus-hibernate-search-extras#179].
ja_jp: 現時点では Quarkus で Lucene バックエンドをサポートする予定はありません。 ただし、Quarkiverse (https://github.com/quarkiverse/quarkus-hibernate-search-extras/issues/179[quarkiverse/quarkus-hibernate-search-extras#179]) では、 このような実装の進捗状況が追跡されています。

source: We don't have plans to support the Lucene backend in Quarkus for now, though there is an issue tracking progress on such an implementation in the Quarkiverse: https://github.com/quarkiverse/quarkus-hibernate-search-extras/issues/180[quarkiverse/quarkus-hibernate-search-extras#180].
ja_jp: 現時点では Quarkus で Lucene バックエンドをサポートする予定はありません。 ただし、Quarkiverse (https://github.com/quarkiverse/quarkus-hibernate-search-extras/issues/180[quarkiverse/quarkus-hibernate-search-extras#180]) では、 このような実装の進捗状況が追跡されています。

source: We don't have plans to support the Lucene backend in Quarkus for now.
ja_jp: 今のところ、QuarkusでLuceneバックエンドをサポートする予定はありません。

source: We don't include the legacy MongoDB client by default. It contains the now retired MongoDB Java API (DB, DBCollection,... ) and the `com.mongodb.MongoClient` that is now superseded by `com.mongodb.client.MongoClient`.
ja_jp: デフォルトではレガシーな MongoDB クライアントは含まれていません。今では引退した MongoDB Java API (DB, DBCollection, ... ) と `com.mongodb.MongoClient` が含まれていますが、今では `com.mongodb.client.MongoClient` に取って代わられています。

source: We don’t want you to spend hours learning new technologies. Instead, the Quarkus programming model builds on top of proven standards. Be it official standards such as Eclipse MicroProfile or leading frameworks in a specific domain such as Eclipse Vert.x.
ja_jp: 新しいテクノロジーの学習に何時間も費やしていただきたくありません。その代わりに、Quarkus プログラミングモデルは、実績のある標準の上に構築されています。それは、Eclipse MicroProfile のような公式標準であったり、Eclipse Vert.x のような特定のドメインにおける主要なフレームワークであったりします。

source: We encourage you to explore the `security-jwt-quickstart` directory and review the quickstart solutions to learn more about the features of the {extension-name} extension.
ja_jp: `security-jwt-quickstart`ディレクトリーでクイックスタートソリューションを確認し、{extension-name} エクステンションの機能に関する情報を学習することを推奨します。

source: We encourage you to test it, even if you track LTS releases, as 3.32 will be the foundation for 3.33 LTS.
ja_jp: 3.32 は 3.33 LTS の基盤となるため、LTS リリースを追跡している場合でも、ぜひテストすることをお勧めします。

source: We encourage you to try out this release and provide feedback through our https://github.com/a2aproject/a2a-java/issues[GitHub issue tracker]. Your input helps shape the future of the A2A Java SDK.
ja_jp: このリリースをぜひお試しいただき、 https://github.com/a2aproject/a2a-java/issues[GitHub イシュートラッカー] を通じてフィードバックをお寄せください。皆様からの入力が A2A Java SDK の将来を形作る助けとなります。

source: We especially send warm thoughts and appreciation to the OSS Repository Hosting by Sonatype enabling the swift publishing for projects that truly are affected by this vulnerability.
ja_jp: 特に、この脆弱性の影響を受けているプロジェクトを迅速に公開することを可能にした、SonatypeのOSSリポジトリホスティングに感謝いたします。

source: We extend our previous tests as a convenience, but you can also implement your tests.
ja_jp: 便宜上、以前のテストを拡張していますが、独自のテストを実装することもできます。

source: We extend our previous tests, but you can also implement your tests
ja_jp: 既存のテストを extend していますが、自分でテストを実装することもできます。

source: We fix that by adding the following comment instruction to the file:
ja_jp: ファイルに以下のコメント命令文を追加することで修正します。

source: We fixed some more issues in this CR. Final is coming at the end of June.
ja_jp: 今回のCRでは、さらにいくつかの問題を修正しました。最終版は6月末になります。

source: We get the expected JSON array. Quarkus REST automatically maps the list into a JSON Array, except if instructed otherwise.
ja_jp: 期待通りのJSON配列が得られます。 Quarkus RESTは特に指示がない限り、自動的にリストをJSON配列にマップします。

source: We get the expected JSON array. RESTEasy Reactive automatically maps the list into a JSON Array, except if instructed otherwise.
ja_jp: 期待通りのJSON配列が得られます。RESTEasy Reactiveでは、特に指示がない限り、リストを自動的にJSON配列にマッピングします。

source: We got some hits, but the default style for the nodes presented is not very readable. We can however tweak the stylesheet as shown by https://neo4j.com/developer/neo4j-browser/#browser-styling-adv[this guide]. Two useful modifications for this use case is to increase the default `node` `diameter` value to say, `150px`. The other modification is to switch `node.Method` `caption` value to `"{display}"`.
ja_jp: いくつかヒットしましたが、表示されるノードのデフォルトスタイルはあまり読みやすくありません。しかし、 link:https://neo4j.com/developer/neo4j-browser/#browser-styling-adv[このガイド]で紹介されているように、スタイルシートを調整することができます。今回のケースでは、デフォルトの `node` `diameter` の値を `150px` に変更することができます。もう一つの修正は、 `node.Method` `caption` の値を `"{display}"` に切り替えることです。

source: We had a lot of feedback and Continuous Testing got a lot of fixes and improvements.
ja_jp: 多くのフィードバックがあり、継続的テストでは多くの修正や改善が行われました。

source: We have a Hello World application that defines `@ApplicationPath("/hello")`
ja_jp: `@ApplicationPath("/hello")` という定義のあるHello World アプリケーションがあるとします。

source: We have a https://www.youtube.com/watch?v=sz5ihmA4gaE&list=PLsM3ZE5tGAVbyncLm7ue2V25cwFck7ew9[playlist] on Quarkus YouTube channel that shows off the new Dev UI, explains the new features and how to use and extend it.
ja_jp: QuarkusのYouTubeチャンネルでは、新しいDev UIの紹介、新機能の説明、使い方や拡張方法などを紹介する link:https://www.youtube.com/watch?v=sz5ihmA4gaE&list=PLsM3ZE5tGAVbyncLm7ue2V25cwFck7ew9[プレイリスト] を公開しています。

source: We have a lot of documentation. Be sure to check our <a href="{{site.baseurl}}/get-started/">Getting started page</a>, and all our <a href="{{site.baseurl}}/guides/">guides</a>. Also check out our <a href="{{site.baseurl}}/faq/">FAQ section</a> and <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO" target="blank">Quarkus Tips Playlist</a>.
ja_jp: 多数のドキュメントがあります。ぜひ <a href="{{site.baseurl}}/get-started/">Getting started ページ</a>と、すべての <a href="{{site.baseurl}}/guides/">ガイド</a>をご確認ください。また、<a href="{{site.baseurl}}/faq/">FAQ セクション</a>と <a href="https://www.youtube.com/playlist?list=PLsM3ZE5tGAVbMz1LJqc8L5LpnfxPPKloO" target="blank">Quarkus Tips Playlist</a> もご覧ください。

source: We have a new extension for buildpacks: `quarkus-container-image-buildpack`.
ja_jp: ビルドパックのための新しいエクステンション、 `quarkus-container-image-buildpack` が出来ました。

source: We have a whole backlog of 60 episodes which for large part are still as relevant as they were when we recorded them.
ja_jp: 私たちには60話のバックログがありますが、その大部分は収録した当時と同じように妥当性があります。

source: We have already looked in detail at how Quarkus OIDC can handle <<opaque-access-tokens>>, but we don't want to propagate Auth0 opaque tokens to micro services which do something useful on behalf on the currently authenticated user, beyond checking its UserInfo.
ja_jp: Quarkus OIDC による <<opaque-access-tokens>> の処理方法を詳しく見てきました。しかし、UserInfo の確認以外の操作を現行の認証済みユーザーに代わって実行するマイクロサービスに、Auth0 の不透明トークンを伝播することは回避する必要があります。

source: We have also started to refine our documentation with instructions for the CLI, Maven and Gradle. This is a work in progress so not all guides are updated, it will get to completion in the following weeks.
ja_jp: また、CLI、Maven、Gradleの説明を含むドキュメントの改良にも着手しました。これは進行中の作業なので、すべてのガイドが更新されているわけではありませんが、今後数週間の内には完成する予定です。

source: We have an extension that is used to test for regressions in the extension processing. It is located in {quarkus-tree-url}/core/test-extension directory. In this section we touch on some of the tasks an extension author will typically need to perform using the test-extension code to illustrate how the task could be done.
ja_jp: エクステンションの処理のリグレッションをテストするために使われるエクステンションがあります。これは {quarkus-tre-url}/core/test-extension ディレクトリにあります。このセクションでは、test-extension のコードを使って、エクステンションの作者が通常行う必要のあるタスクについて触れます。

source: We have an extension that is used to test for regressions in the extension processing. It is located in {quarkus-tree-url}/integration-tests/test-extension/extension directory. In this section we touch on some tasks an extension author will typically need to perform using the test-extension code to illustrate how the task could be done.
ja_jp: エクステンションの処理のリグレッションをテストするために使われるエクステンションがあります。これは、{quarkus-tree-url}/integration-tests/test-extension/extension ディレクトリーにあります。このセクションでは、エクステンションの作成者が通常行う必要があるいくつかのタスクについて、test-extension コードを使用してその方法を示します。

source: We have been hard at work during Summer to bake Quarkus 1.8.
ja_jp: 夏の間、Quarkus1.8を作り上げるために頑張ってきました。

source: We have been working hard to make sure that the Quarkus Platform is ready for production use. Not every extension found in Quarkus 2 Platform is available or not yet final in Quarkus 3 Platform yet, but they are on their way.
ja_jp: 私たちは、Quarkus Platformをプロダクションで使用できるようにするために、懸命に努力してきました。Quarkus 2 Platformにある全てのエクステンションがQuarkus 3 Platformで利用できるわけではありませんし、まだ最終版ではありませんが、その方向で進んでいます。

source: We have confirmed that the Quarkus endpoint can be accessed by users who have authenticated with the help of `Auth0`.
ja_jp: `Auth0` を使用して認証されたユーザーが Quarkus エンドポイントにアクセスできることを確認しました。

source: We have discussed in the <<role-based-access-control>> section how to get Quarkus to check a namespace qualified claim containing user roles and use this information to enforce role-based access control. You have configured Auth0 to add the custom roles claim to both ID and access tokens.
ja_jp: <<role-based-access-control>> セクションでは、Quarkus でユーザーロールを含む namespace で修飾されたクレームをチェックする方法と、その情報を使用してロールベースのアクセス制御を適用する方法について説明しました。Auth0 はすでに、ID トークンとアクセストークンの両方にカスタムロールクレームを追加するように設定されています。

source: We have had an unusually bumpy ride the last few weeks. Path resolution can be sneakily complicated, and in trying to make things better, we accidentally made them worse! We've fixed it all now, but you might notice some changes. Hopefully, this post will make clear what those changes are, what they mean, and what you can do to put everything back the way you want it.
ja_jp: ここ数週間、私たちは通常になく揺れ動いていました。パスの解決はこっそりと複雑になることがあり、物事を良くしようとしているうちに、私たちは誤って悪化させてしまったのです!今はすべて修正しましたが、いくつかの変更点があることに気づくかもしれません。うまくいけば、この記事でその変更が何であるか、その意味、そしてあなたが望むようにすべてを元の状態に戻すために何ができるか明確になるでしょう。

source: We have introduced partial support for Qute type-safe message bundles. If you defined `@MessageBundle` classes in your code, you'll automatically get autocompletion for those messages in your Qute templates, with the messages rendered as inlay hints:
ja_jp: Quteのタイプセーフメッセージバンドルに部分的に対応しました。あなたのコードで `@MessageBundle` クラスを定義した場合、Qute テンプレートで自動的にメッセージの自動補完が行われ、メッセージがインレイヒントとしてレンダリングされます：

source: We have made several iterations of our instrumentation-based live reload (meaning we don't restart Quarkus but just perform class redefinition when we can) since its first introduction.
ja_jp: インストゥルメンテーションベースのライブリロード（可能な場合にQuarkusを再起動せず、クラスの再定義を行うこと）を最初に導入して以来、何度もイテレーションを繰り返しています。

source: We have not provided any JWT in our request, so we would not expect that there is any security state seen by the endpoint, and the response is consistent with that:
ja_jp: このリクエストではJWTを設定していませんので、エンドポイントから見たセキュリティーステートがあるとは期待できず、レスポンスもそれに沿ったものとなっています。

source: We have not provided any token in our request, so we would not expect that there is any security state seen by the endpoint, and the response is consistent with that:
ja_jp: リクエストでトークンを提供していないため、エンドポイントが見ているセキュリティー状態があるとは期待できず、レスポンスもそれと一致しています:

source: We have prepared the code, and now let's configure the application:
ja_jp: コードの準備ができたので、次はアプリケーションを設定します。

source: We have seen together how to test your extension and sometimes things don't go so well and you want to debug your tests. Same principle here, the trick is to enable the Maven Surefire remote debugging in order to attach an IDE `Remote` configuration.
ja_jp: エクステンションをテストする方法を一緒に見てきましたが、時にはうまくいかず、テストをデバッグしたい場合もあります。ここでも同じ原理で、IDE `Remote` の設定をアタッチするために Maven Surefire リモートデバッグを有効にします。

source: We have worked through the original https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] tutorial in the <<vertx-oidc-vertx>> section, and now we can start planning moving the Vert.x applicaton to Quarkus, while retaining Vert.x OIDC.
ja_jp: <<vertx-oidc-vertx>> セクションでオリジナルの https://how-to.vertx.io/web-and-oauth2-oidc/#create-a-project[Securing a Web Application with OAuth2/OpenID Connect] チュートリアルを進めました。ここからは、Vert.x OIDC を保持したまま、Vert.x アプリケーションを Quarkus に移行する計画を立てることができます。

source: We highly recommend to have a look at the https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.31[migration guide] as this version comes with some important changes.
ja_jp: このバージョンにはいくつかの重要な変更が含まれているため、 link:https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.31[移行ガイド] を参照することを強くお勧めします。

source: We hope https://ja.quarkus.io[https://ja.quarkus.io] will be of great help to the user community in Japan.
ja_jp: https://ja.quarkus.io[https://ja.quarkus.io] が日本のユーザーコミュニティに大いに役立つことを願っています。

source: We hope that, at some point, this limitation will be lifted by the Leyden team. If that happens, we will return to the `fast-jar` packaging, or an evolution of it.
ja_jp: いずれかの時点で、この制限が Leyden チームによって解除されることを願っています。もしそうなれば、`fast-jar` パッケージング、またはその進化版に戻る予定です。
